; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 - counter
	)
  (:init
		(= (value c0) 69)
	(= (value c1) 41)
	(= (value c2) 50)
	(= (value c3) 28)
	(= (value c4) 18)
	(= (value c5) 78)
	(= (value c6) 71)
	(= (value c7) 87)
	(= (value c8) 89)
	(= (value c9) 14)
	(= (value c10) 59)
	(= (value c11) 100)
	(= (value c12) 84)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
		)
	)
)

; plan
1. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 6 of 12
2. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 6 of 12
3. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 6 of 12
4. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 6 of 12
5. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 6 of 12
6. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 6 of 12
7. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 12
8. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 12
9. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 6 of 12
10. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 6 of 12
11. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 6 of 12
12. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 6 of 12
13. (increment c6)
   changed: (value c6) from 71 to 75
   goals met: 6 of 12
14. (increment c6)
   changed: (value c6) from 75 to 79
   goals met: 7 of 12
15. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 7 of 12
16. (increment c4)
   changed: (value c4) from 18 to 21
   goals met: 7 of 12
17. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 7 of 12
18. (increment c4)
   changed: (value c4) from 21 to 25
   goals met: 7 of 12
19. (increment c4)
   changed: (value c4) from 25 to 29
   goals met: 8 of 12
20. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 8 of 12
21. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 12
22. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 12
23. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 8 of 12
24. (increment c3)
   changed: (value c3) from 28 to 32
   goals met: 7 of 12
25. (increment c4)
   changed: (value c4) from 29 to 33
   goals met: 8 of 12
26. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 8 of 12
27. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 8 of 12
28. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 8 of 12
29. (increment c3)
   changed: (value c3) from 32 to 37
   goals met: 7 of 12
30. (increment c4)
   changed: (value c4) from 33 to 37
   goals met: 7 of 12
31. (increment c4)
   changed: (value c4) from 37 to 41
   goals met: 8 of 12
32. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 8 of 12
33. (increment c3)
   changed: (value c3) from 37 to 43
   goals met: 7 of 12
34. (increment c4)
   changed: (value c4) from 41 to 45
   goals met: 8 of 12
35. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 8 of 12
36. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 8 of 12
37. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 8 of 12
38. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 8 of 12
39. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 8 of 12
40. (increment c12)
   changed: (value c12) from 84 to 89
   goals met: 8 of 12
41. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 8 of 12
42. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 8 of 12
43. (increment c12)
   changed: (value c12) from 89 to 94
   goals met: 8 of 12
44. (increment c12)
   changed: (value c12) from 94 to 99
   goals met: 8 of 12
45. (decrement c11)
   changed: (value c11) from 100 to 98
   goals met: 9 of 12
46. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 9 of 12
47. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 9 of 12
48. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 9 of 12
49. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 9 of 12
50. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 9 of 12
51. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 9 of 12
52. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 9 of 12
53. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 9 of 12
54. (increment c9)
   changed: (value c9) from 14 to 23
   goals met: 9 of 12
55. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 9 of 12
56. (increment c9)
   changed: (value c9) from 23 to 33
   goals met: 9 of 12
57. (increment c9)
   changed: (value c9) from 33 to 43
   goals met: 9 of 12
58. (increment c9)
   changed: (value c9) from 43 to 53
   goals met: 9 of 12
59. (increment c9)
   changed: (value c9) from 53 to 63
   goals met: 8 of 12
60. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 8 of 12
61. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 8 of 12
62. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 8 of 12
63. (decrement c9)
   changed: (value c9) from 63 to 53
   goals met: 9 of 12
64. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 9 of 12
65. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 9 of 12
66. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 9 of 12
67. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 9 of 12
68. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 9 of 12
69. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 9 of 12
70. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 9 of 12
71. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 9 of 12
72. (increment c1)
   changed: (value c1) from 41 to 47
   goals met: 9 of 12
73. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 9 of 12
74. (increment c1)
   changed: (value c1) from 47 to 54
   goals met: 8 of 12
75. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 8 of 12
76. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 8 of 12
77. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 8 of 12
78. (increment c1)
   changed: (value c1) from 54 to 64
   goals met: 8 of 12
79. (increment c1)
   changed: (value c1) from 64 to 74
   goals met: 9 of 12
80. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 9 of 12
81. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 9 of 12
82. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 9 of 12
83. (decrement c1)
   changed: (value c1) from 74 to 64
   goals met: 8 of 12
84. (increment c3)
   changed: (value c3) from 43 to 49
   goals met: 7 of 12
85. (increment c4)
   changed: (value c4) from 45 to 49
   goals met: 7 of 12
86. (increment c4)
   changed: (value c4) from 49 to 53
   goals met: 8 of 12
87. (increment c3)
   changed: (value c3) from 49 to 55
   goals met: 8 of 12
88. (increment c4)
   changed: (value c4) from 53 to 57
   goals met: 9 of 12
89. (increment c2)
   changed: (value c2) from 50 to 55
   goals met: 8 of 12
90. (increment c3)
   changed: (value c3) from 55 to 61
   goals met: 8 of 12
91. (increment c4)
   changed: (value c4) from 57 to 61
   goals met: 8 of 12
92. (increment c4)
   changed: (value c4) from 61 to 65
   goals met: 9 of 12
93. (increment c2)
   changed: (value c2) from 55 to 60
   goals met: 9 of 12
94. (increment c1)
   changed: (value c1) from 64 to 74
   goals met: 10 of 12
95. (increment c2)
   changed: (value c2) from 60 to 65
   goals met: 9 of 12
96. (increment c3)
   changed: (value c3) from 61 to 67
   goals met: 9 of 12
97. (increment c4)
   changed: (value c4) from 65 to 69
   goals met: 10 of 12
98. (decrement c1)
   changed: (value c1) from 74 to 64
   goals met: 10 of 12
99. (increment c9)
   changed: (value c9) from 53 to 63
   goals met: 9 of 12
100. (increment c9)
   changed: (value c9) from 63 to 73
   goals met: 9 of 12
101. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 9 of 12
102. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 9 of 12
103. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 9 of 12
104. (increment c10)
   changed: (value c10) from 59 to 62
   goals met: 9 of 12
105. (increment c10)
   changed: (value c10) from 62 to 65
   goals met: 9 of 12
106. (decrement c9)
   changed: (value c9) from 73 to 63
   goals met: 10 of 12
107. (decrement c8)
   changed: (value c8) from 89 to 79
   goals met: 9 of 12
108. (increment c9)
   changed: (value c9) from 63 to 73
   goals met: 8 of 12
109. (increment c10)
   changed: (value c10) from 65 to 68
   goals met: 8 of 12
110. (increment c10)
   changed: (value c10) from 68 to 71
   goals met: 8 of 12
111. (increment c10)
   changed: (value c10) from 71 to 74
   goals met: 9 of 12
112. (increment c8)
   changed: (value c8) from 79 to 89
   goals met: 10 of 12
113. (increment c9)
   changed: (value c9) from 73 to 83
   goals met: 9 of 12
114. (increment c10)
   changed: (value c10) from 74 to 77
   goals met: 9 of 12
115. (increment c10)
   changed: (value c10) from 77 to 80
   goals met: 9 of 12
116. (increment c10)
   changed: (value c10) from 80 to 83
   goals met: 9 of 12
117. (increment c10)
   changed: (value c10) from 83 to 86
   goals met: 10 of 12
118. (increment c9)
   changed: (value c9) from 83 to 93
   goals met: 10 of 12
119. (increment c10)
   changed: (value c10) from 86 to 89
   goals met: 10 of 12
120. (increment c10)
   changed: (value c10) from 89 to 92
   goals met: 10 of 12
121. (increment c10)
   changed: (value c10) from 92 to 95
   goals met: 11 of 12
122. (increment c1)
   changed: (value c1) from 64 to 74
   goals met: 11 of 12
123. (increment c2)
   changed: (value c2) from 65 to 70
   goals met: 10 of 12
124. (increment c3)
   changed: (value c3) from 67 to 73
   goals met: 10 of 12
125. (increment c2)
   changed: (value c2) from 70 to 75
   goals met: 10 of 12
126. (increment c3)
   changed: (value c3) from 73 to 79
   goals met: 11 of 12
127. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 11 of 12
128. (decrement c3)
   changed: (value c3) from 79 to 72
   goals met: 10 of 12
129. (decrement c3)
   changed: (value c3) from 72 to 65
   goals met: 11 of 12
130. (decrement c2)
   changed: (value c2) from 75 to 70
   goals met: 10 of 12
131. (decrement c2)
   changed: (value c2) from 70 to 65
   goals met: 10 of 12
132. (decrement c2)
   changed: (value c2) from 65 to 60
   goals met: 11 of 12
133. (decrement c1)
   changed: (value c1) from 74 to 64
   goals met: 10 of 12
134. (decrement c1)
   changed: (value c1) from 64 to 54
   goals met: 11 of 12
135. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 11 of 12
136. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 11 of 12
137. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 11 of 12
138. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 11 of 12
139. (decrement c0)
   changed: (value c0) from 69 to 65
   goals met: 11 of 12
140. (decrement c0)
   changed: (value c0) from 65 to 61
   goals met: 11 of 12
141. (decrement c0)
   changed: (value c0) from 61 to 57
   goals met: 11 of 12
142. (decrement c0)
   changed: (value c0) from 57 to 53
   goals met: 12 of 12
